[Killed] BlockStatement
gradeToLetter.js:1:48
-module.exports = function gradeToLetter(score) {
-  // Check for non-number or NaN (NaN is typeof number so needs explicit check)
-  if (typeof score !== 'number' || isNaN(score) || score < 0 || score > 100) {
-    return 'Invalid input. Please provide a number.';
-  }
-
-  if (score >= 90) {
-    return "A";
-  } else if (score >= 80) {
-    return "B";
-  } else if (score >= 70) {
-    return "C";
-  } else if (score >= 60) {
-    return "D";
-  } else {
-    return "F";
-  }
-};
+module.exports = function gradeToLetter(score) {};
 
killedBy: gradeToLetter should return 95 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: undefined

[Killed] LogicalOperator
gradeToLetter.js:3:7
 module.exports = function gradeToLetter(score) {
   // Check for non-number or NaN (NaN is typeof number so needs explicit check)
-  if (typeof score !== 'number' || isNaN(score) || score < 0 || score > 100) {
+  if ((typeof score !== 'number' || isNaN(score) || score < 0) && score > 100) {
     return 'Invalid input. Please provide a number.';
   }
killedBy: gradeToLetter should return an error message for non-numeric input a
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Invalid input. Please provide a number."
Received: "F"

[Killed] EqualityOperator
gradeToLetter.js:3:65
 module.exports = function gradeToLetter(score) {
   // Check for non-number or NaN (NaN is typeof number so needs explicit check)
-  if (typeof score !== 'number' || isNaN(score) || score < 0 || score > 100) {
+  if (typeof score !== 'number' || isNaN(score) || score < 0 || score >= 100) {
     return 'Invalid input. Please provide a number.';
   }
killedBy: gradeToLetter should return 100 for a score of NaN
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "A"
Received: "Invalid input. Please provide a number."
